tests/data/webhooks/payments.failed.json

{
  "id": "wh_xXmV329qz2NYQMl",
  "object": "webhook",
  "name": "payments.failed",
  "data": {
    "session": {
      "id": "ses_7vJaZ5m8O21EoY3",
      "object": "session",
      "status": "finished",
      "payment_type": "recurring",
      "customer": {
        "id": "cus_gP8N9l23JD36Lbm",
        "email": "john.doe@example.com",
        "object": "customer",
        "last_name": "Doe",
        "first_name": "John"
      },
      "order_id": "test_order",
      "order_name": "Premium subscription",
      "fiat_amount": 1.5,
      "created_date": 1665645049,
      "fiat_currency_code": "USD"
    },
    "subscription": {
      "id": "sub_yJGnv5794DNqlex",
      "name": "Premium",
      "object": "subscription",
      "status": "failed",
      "interval": "month",
      "fiat_amount": 1.5,
      "created_date": 1665645392,
      "deleted_date": null,
      "currency_code": "USDC",
      "currency": {
        "id": "cur_OZxelV2Bg5EoAQ0",
        "object": "currency",
        "code": "USDC",
        "blockchain": "ethereum",
        "coin_type": "erc20"
      },
      "interval_count": 1,
      "next_payment_date": 1673568000,
      "fiat_currency_code": "USD"
    },
    "payment_intent": {
      "id": "pi_0JwYj2l7wDXeNn8",
      "amount": 1.5,
      "object": "payment_intent",
      "status": "failed",
      "customer": {
        "id": "cus_gP8N9l23JD36Lbm",
        "email": "john.doe@example.com",
        "object": "customer",
        "last_name": "Doe",
        "first_name": "John"
      },
      "payments": [],
      "fiat_amount": 1.5,
      "paid_amount": 0,
      "created_date": 1665646175,
      "currency_code": "USDC",
      "currency": {
        "id": "cur_OZxelV2Bg5EoAQ0",
        "object": "currency",
        "code": "USDC",
        "blockchain": "ethereum",
        "coin_type": "erc20"
      },
      "exchange_rate": 1,
      "paid_fiat_amount": 0,
      "fees": {
        "object": "fee",
        "amount": 0,
        "fiat_amount": 0,
        "currency": {
          "id": "cur_OZxelV2Bg5EoAQ0",
          "object": "currency",
          "code": "USDT",
          "blockchain": "ethereum",
          "coin_type": "erc20"
        },
        "fiat_currency_code": "USD"
      }
    }
  }
}
